{
  "basics": {
    "name": "Chase Sang",
    "label": "P.Eng / Junior Developer",
    "picture": "./Profile.jpg",
    "email": "chase.sang@gmail.com",
    "phone": "4038700889",
    "website": "http://",
    "introducation": "Hi, I am Chase. Urbanite. Explorer. Pianist. Engineer. Fitness Instructor. Cross-fit hater. Never stop learning, because life never stops teaching",
    "summary": "A full-stack web  developer with a strong technical background in engineering, and years of project management experience",
    "location": {
      "city": "Vancouver",
      "provice": "BC",
      "country": "Canada"
    },
    "profiles": [
      {
        "network": "facebook",
        "username": "chasesang"

      },
      {
        "network": "Github",
        "username": "chasesang"
      }
    ]
  },
  "work": [
    {
      "company": "Shell Canada",
      "position": "Process Engineer, P.Eng",
      "startDate": "2013-11-01",
      "endDate": "2016-09-01",
      "summary": "Monitored and solved process issues from industrial plants to ensure maximum optimal uptime of facility. Directed and successfully executed capital projects ranging from $100K to $5 million. Developed engineering tools and procedures for Foothills region, which effectively reduced manual workload by 66% and improved calculation accuracy.",
      "highlights": []
    },
    {
      "company": "Shell Canada",
      "position": "Operations Engineer",
      "startDate": "2010-01-04",
      "endDate": "2013-10-31",
      "summary": "Responsibly provided technical support to safely and efficiently operate in order to maximize the production. Led initiatives to optimize LPG production, which resulted in approx. $2 million/year of revenue and energy savings.",
      "highlights": []
    }
  ],
  "engineeringwork": [
    {
      "company": "Shell Canada",
      "position": "Process Engineer, P.Eng",
      "startDate": "2015-09-01",
      "endDate": "2016-08-31",
      "summary": "Directed and managed capital projects ranging from $100K to $5 million, such as Sulphur Degass Tank Design/Construction, Plant Capacity Turn-Down studies, Utilities Boiler Upgrade Project etc. Led initiatives to optimize Control and Automation systems in Sulphur Recovery, LPG Recovery and Utilities operating systems, resulting in over $100K annual savings. Developed standard process monitoring tools and procedures for all gas plants in Foothills region, effectively reducing manual workload by 66% and improving calculation accuracy. Appointed as the Technical Focal Point for sour gas sweetening, ethane/LPG recovery, and sulphur recovery issues in Foothills sour gas processing plants. Developed strong operational background in amine management (MDEA & sulfinol D), LPG dehydration and recovery, Claus, SuperClaus and SCOT process, sulphur degassing, sour water stripping, and water treatment. Coordinated and participated in process and equipment troubleshooting, performance testing ¬¬and reviews, start ups, shutdowns, and turnaround planning ",
      "highlights": []
    },
    {
      "company": "Shell Canada",
      "position": "Operations Engineer & Safeguarding & Energy Management Focal Point, P.Eng",
      "startDate": "2013-11-01",
      "endDate": "2015-08-31",
      "summary": "Supervised and managed multiple turnaround projects valued from $10K up $2 million+ on schedule and within budget (turnaround cost approx. $15 million for entire plant). Conducted daily and long term monitoring of Sulphur Recovery & Utilities areas. Identified optimization opportunities and initiated turndown and upgrade projects resulting up to $100K cost saving annually. Coordinated revalidations for all assets to ensure compliance with the 5 years assurance reviews, including preparations for HAZOPs, TOR, and necessary deviations as safeguarding focal point. Collected monthly and yearly energy consumption for the operating plant. Prepared the Energy Accountability/Management report, as well as the forecast demands. Responsible Contact Engineer for Sulphur Recovery/Utilities/Energy Management and Safeguarding focal point for Central Alberta Region. ",
      "highlights": []
    },
    {
      "company": "Shell Canada",
      "position": "Operations Engineer, EIT",
      "startDate": "2011-09-01",
      "endDate": "2013-10-31",
      "summary": "Using HYSYS and Control/Automation techniques, optimized ethane fractionation train production which resulted in approx. $2 million/year of greater LPG revenue and energy savings. Performed duties as the unit engineer for sour gas processing and LPG fractionation units. Planned and safely executed several planned turnarounds and startups. Effectively completed the projects on time, within budget, and “Goal Zero” safety record. Responsibly provided technical advice and assistance for operations/maintenance. Coordinated with drilling, reservoir, and facilities engineering on regular basis for detailed business forecast, operations strategy planning, and potential opportunity exploration",
      "highlights": []
    },
    {
      "company": "Shell Canada",
      "position": "Operations Engineering Co-Op Student",
      "startDate": "2010-01-04",
      "endDate": "2010-08-31",
      "summary": "Completed Energy Efficiency Management Project. Re-designed Real-time Energy Monitoring Tool and Energy Management Tool. Identified current deficiencies and conducted performance test and inspection on steam system, steam turbines and steam traps. Reviewed Pressure Relief Flare system and conducted an engineering study on continuous gas purging via flare headers to stack. Evaluated various alternatives based on economics and operation feasibility. Organized and completed “Lean Burn” technology project on compressors. It was designed to improve the performance of heavy-duty compressors and reduce GHG emissions. ",
      "highlights": []
    },
    {
      "company": "Syncrude",
      "position": "Conversion Technical Co-op Student",
      "startDate": "2009-05-01",
      "endDate": "2009-08-01",
      "summary": "Executed a turnaround of a sour water treatment unit. Planned the work scope and managed sour water processing ability and storage capacity. Performed duties of a contact engineer for part of the Coker Plant. Responsibly monitored the operating status of the plant daily and organized troubleshooting activities with Conversion Technical team. ",
      "highlights": []
    }
  ],
  "volunteer": [],
  "education": [
    {
      "institution": "CodeCore Bootcamp",
      "area": "",
      "studyType": "Certificate of Web Development ",
      "startDate": "2017-03-01",
      "endDate": "2017-05-01",
      "gpa": "",
      "courses": []
    },
    {
      "institution": "Dalhousie University",
      "area": "with Distinction",
      "studyType": "Bachelor of Chemical Engineering (hons)",
      "startDate": "2006-01-01",
      "endDate": "2010-05-01",
      "gpa": "",
      "courses": []
      }
  ],
  "awards": [
    {
      "title": "Shell Special Recognition Award",
      "name": "Turnaround Safety",
      "year": "May 2015"
    },
    {
      "title": "Shell VP Innovation Award",
      "name": "Process Control",
      "year": "May 2014"
    }
  ],
  "publications": [],
  "skills": [
    {
      "keywords": [
        "HTML",
        "CSS",
        "Javascript",
        "ES2015",
        "ES2016",
        "jQuery",
        "Ruby",
        "React",
        "SASS",
        "Node.js",
        "Gulp",
        "Grunt",
        "Babel",
        "Bootstrap",
        "Materialize",
        "Rails",
        "Node",
        "php",
        "MySQL",
        "PostgreSQL",
        "Git",
        "Github",
        "Responsive"
      ]
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Native speaker"
    },
    {
      "language": "Chinese",
      "fluency": "Native speaker"
    }
  ],
  "interests": [
    {
      "name": "Guitar",
      "keywords": []
    }
  ],
  "references": []
}
